[
  {
    "title": "US GDP Contraction Revised Lower",
    "content": "The US economy shrank by an annualized 31.7 percent in the second quarter of 2020, lower than a 32.9 percent plunge in the advance estimate and compared to market forecasts of a 32.5 percent fall. Still, it is the biggest contraction ever, pushing the economy into a recession as the coronavirus pand...demic forced many businesses including restaurants, cafes, stores and factories to close and people to stay at home, hurting consumer and business spending. Private inventory investment and personal consumption expenditures (PCE) decreased less than previously estimated. In contrast, business investment fell more, mainly due to structures and intellectual property products. The recovery will depend on the capacity of the country to control the pandemic and avoid more waves of infections. Fed officials see the US economy shrinking 6.5 percent in 2020. more",
    "date": "2020-08-27"
  },
  {
    "title": "US Economy Shrinks at Record 32.9%",
    "content": "The US economy shrank by an annualized 32.9 percent in the second quarter of 2020, compared to forecasts of a 34.1 percent plunge, the advance estimate showed. It is the biggest contraction ever, pushing the economy into a recession as the coronavirus pandemic forced many businesses including restau...urants, cafes, stores and factories to close and people to stay at home, hurting consumer and business spending. Decreases were seen in personal consumption, exports, private inventory investment, nonresidential fixed investment, residential fixed investment, and state and local government spending while federal government spending jumped. The recovery will depend on the capacity of the country to control the pandemic and avoid more waves of infections. Still, the number of new cases continues to increase, making several states to scale back or pause the reopening of their economies. Fed officials see the US economy shrinking 6.5 percent in 2020 more",
    "date": "2020-07-30"
  },
  {
    "title": "US Economy Likely to Post Record Contraction",
    "content": "The US economy is expected to have shrank by an annualized 34.1 percent on quarter in the second quarter of 2020. It would be the sharpest contraction ever as the coronavirus pandemic forced many businesses including restaurants, cafes, stores and factories to close and people to stay at home, hurti...ing consumer and business spending. Q2 contraction would also be more than four times worse than the decline seen during the 2007-09 financial crisis and would put the American economy in recession, following a 5 percent decrease in the first quarter. The recovery will depend on the capacity of the country to control the pandemic and avoid more waves of infections. Still, the number of new cases continues to increase, making several states to scale back or pause the reopening of their economies. Fed officials see the US economy shrinking 6.5 percent in 2020 more",
    "date": "2020-07-30"
  },
  {
    "title": "US Economy Shrinks 5% in Q1",
    "content": "The US economy shrank by an annualized 5 percent in the first quarter of 2020, in line with the previous estimate and ending the longest period of expansion in the country's history. It is the biggest drop in GDP since the last quarter of 2008 as the Covid-19 pandemic forced several states to impose...e lockdown measures in mid-March, throwing millions of people out of work. With the third estimate, an upward revision to nonresidential fixed investment was offset by downward revisions to private inventory investment, personal consumption expenditures (PCE), and exports more",
    "date": "2020-06-25"
  }
]